src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_ЗапросыКДанным/бир_ЗапросыКДанным.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>бир_ЗапросыКДанным</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Ид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Запрос</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/БиблиотекаИнструментовРазработки/src/Catalogs/бир_ЗапросыКДанным/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Функция - возвращает список всех запросов в справочнике
//
// Параметры:
//   Поля    - Строка                 - список добавляемых в описание полей (строка разделенная "," или массив)
//             Массив из Строка         поля Ид и Наименование возвращаются всегда
//                                      возможные значения: Поля, Параметры, Запрос, Описание
//
// Возвращаемое значение:
//   Массив из Структура                         - список запросов из справочника запросов
//                                                 состав полей указазывается в параметре "Поля"
//     *Ид                 - Строка                - идентификатор запроса
//     *Код                - Строка                - код элемента справочника запросов
//     *Наименование       - Строка                - наименование запроса
//     *Родитель           - СправочникОбъект      - родительская группа справочника запросов
//                           .бир_ЗапросыКДанным
//     *Предопределенный   - Булево                - флаг предопределенного элемента справочника
//     *ПометкаУдаления    - Булево                - пометка удаления
//     *Описание           - Строка                - описание запроса
//     *Запрос             - Строка                - описание запроса в формате JSON
//     *Поля               - Массив из Структура   - описание полей запроса (см. Поля())
//     *Параметры          - Массив из Структура   - описание параметров запроса (см. Параметры())
//
Функция Запросы(Знач Поля = "") Экспорт
	
	Если НЕ ЗначениеЗаполнено(Поля) Тогда
		Поля = Новый Массив();
	КонецЕсли;
	Если ТипЗнч(Поля) = Тип("Строка") Тогда
		Поля = СтрРазделить(Поля, ",", Ложь);
	КонецЕсли;
	Для й = 0 По Поля.ВГраница() Цикл
		Поля[й] = СокрЛП(Поля[й]);
	КонецЦикла;

	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗапросыКДанным.Ссылка КАК Ссылка,
	                      |	ЗапросыКДанным.Родитель КАК Родитель,
	                      |	ЗапросыКДанным.Код КАК Код,
	                      |	ЗапросыКДанным.Наименование КАК Наименование,
	                      |	ЗапросыКДанным.Ид КАК Ид,
	                      |	ЗапросыКДанным.Описание КАК Описание,
	                      |	ЗапросыКДанным.Запрос КАК Запрос,
	                      |	ЗапросыКДанным.Предопределенный КАК Предопределенный,
	                      |	ЗапросыКДанным.ПометкаУдаления КАК ПометкаУдаления
	                      |ИЗ
	                      |	Справочник.бир_ЗапросыКДанным КАК ЗапросыКДанным
	                      |ГДЕ
	                      |	НЕ ЗапросыКДанным.ЭтоГруппа
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ид");
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Запросы = Новый Массив();

	Пока Выборка.Следующий() Цикл
		
		ОписаниеЗапроса = Новый Структура();
		ОписаниеЗапроса.Вставить("Ид"          , Выборка.Ид);
		ОписаниеЗапроса.Вставить("Наименование", Выборка.Наименование);
		
		Для Каждого ТекПоле Из Поля Цикл
			Если ОписаниеЗапроса.Свойство(ТекПоле) Тогда
				Продолжить;
			КонецЕсли;
			Если Результат.Колонки.Найти(ТекПоле) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			ОписаниеЗапроса.Вставить(ТекПоле, Выборка[ТекПоле]);
		КонецЦикла;

		Если НЕ (Поля.Найти("Поля") = Неопределено И Поля.Найти("Параметры") = Неопределено) Тогда
			ЗапросОбъект = Выборка.Ссылка.ПолучитьОбъект();
		КонецЕсли;

		Если НЕ Поля.Найти("Поля") = Неопределено Тогда
			ОписаниеЗапроса.Вставить("Поля", ЗапросОбъект.Поля());
		КонецЕсли;
		Если НЕ Поля.Найти("Параметры") = Неопределено Тогда
			ОписаниеЗапроса.Вставить("Параметры", ЗапросОбъект.Параметры());
		КонецЕсли;

		Запросы.Добавить(ОписаниеЗапроса);
	КонецЦикла;

	Возврат Запросы;

КонецФункции // Запросы()

// Функция - возвращает ссылка на элемент справочника запросов
// или полученный из справочника объект по указанному идентификатору или ссылке
//
// Параметры:
//   Ид        - Строка                 - идентификатор запроса или ссылка на элемент справочника
//               СправочникСсылка
//               .бир_ЗапросыКДанным
//   Объект    - Булево                 - Истина - получить объект справочника запросов
//                                        Ложь - получить ссылку на элемент справочника запросов
//
// Возвращаемое значение:
//   СправочникСсылка        - ссылка на элемент справочника запросов
//   .бир_ЗапросыКДанным       или полученный из справочника объект
//   СправочникОбъект
//   .бир_ЗапросыКДанным
//
Функция Запрос(Ид, Объект = Ложь) Экспорт

	ТипИд = ТипЗнч(Ид);
	Если ТипИд = Тип("СправочникСсылка.бир_ЗапросыКДанным") Тогда
		Запрос = Ид;
	ИначеЕсли ТипИд = Тип("Строка") Тогда
		Запрос = Справочники.бир_ЗапросыКДанным.НайтиПоРеквизиту("Ид", Ид);
	Иначе
		ТекстОшибки = СтрШаблон("Некорректный тип ""%1"" идентификатора запроса ""%2""!
		                        |Ожидается ""Строка"" или ""СправочникСсылка.бир_ЗапросыКДанным"".",
		                        ТипИд,
		                        Ид);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Если Запрос.Пустая() Тогда
		ТекстОшибки = СтрШаблон("Не найден запрос по идентификатору ""%1""!", Ид);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;

	Если Объект Тогда
		Попытка
			Запрос = Запрос.ПолучитьОбъект();
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстОшибки = СтрШаблон("Ошибка получения объекта запроса ""%1"":%2%3!",
			                        Запрос,
			                        Символы.ПС,
			                        ТекстОшибки);
			ВызватьИсключение ТекстОшибки;
		КонецПопытки;
	КонецЕсли;
	
	Возврат Запрос;

КонецФункции // Запрос()

// Функция - возвращает обработку-процессор запросов
//
// Параметры:
//   Ид           - Строка,               - идентификатор запроса или ссылка на элемент справочника
//                  СправочникСсылка
//                  .бир_ЗапросыКДанным
//   ПоУмолчанию  - Булево                - Истина - получить процессор запросов со значениями параметров по умолчанию;
//                                          Ложь - получить ранее инициализированный процессор запросов
//
// Возвращаемое значение:
//   ОбработкаОбъект           - обработка-процессор запросов
//   .бир_ПроцессорЗапросов
//
Функция ПроцессорЗапросов(Ид, ПоУмолчанию = Ложь) Экспорт

	Запрос = Запрос(Ид, Истина);
	Попытка
		ПроцессорЗапросов = Запрос.ПроцессорЗапросов();
	Исключение
		ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстОшибки = СтрШаблон("Ошибка получения процессора запросов для запроса ""%1"":%2%3!",
		                        Запрос.Ссылка,
		                        Символы.ПС,
		                        ТекстОшибки);
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;

	Возврат ПроцессорЗапросов;

КонецФункции // ПроцессорЗапросов()

// Функция - возвращает описание указанного объекта запроса
//
// Параметры:
//   Ид      - Строка                 - идентификатор запроса или ссылка на элемент справочника
//             СправочникСсылка
//             .бир_ЗапросыКДанным
//   Поля    - Строка                 - список добавляемых в описание полей (строка разделенная "," или массив)
//             Массив из Строка         поля Ид и Наименование возвращаются всегда
//                                      возможные поля: Поля, Параметры, Описание
//
// Возвращаемое значение:
//   Массив из Структура                         - описание указанного объекта запроса
//                                                 состав полей указазывается в параметре "Поля"
//     *Ид                 - Строка                - идентификатор запроса
//     *Код                - Строка                - код элемента справочника запросов
//     *Наименование       - Строка                - наименование запроса
//     *Родитель           - СправочникОбъект      - родительская группа справочника запросов
//                           .бир_ЗапросыКДанным
//     *Предопределенный   - Булево                - флаг предопределенного элемента справочника
//     *ПометкаУдаления    - Булево                - пометка удаления
//     *Описание           - Строка                - описание запроса
//     *ТекстЗапроса       - Строка                - текст запроса
//     *Поля               - Массив из Структура   - описание полей запроса (см. ПоляЗапроса())
//     *Параметры          - Массив из Структура   - описание параметров запроса (см. ПараметрыЗапроса())
//
Функция ОписаниеЗапроса(Ид, Знач Поля = "") Экспорт
	
	Запрос = Запрос(Ид, Истина);
	
	Возврат Запрос.Описание(Поля);

КонецФункции // ОписаниеЗапроса()

// Функция - возвращает поля запроса, возвращающего данные для указанного объекта запроса
//
// Параметры:
//   Ид                  - Строка                - идентификатор запроса или ссылка на элемент справочника
//                         СправочникСсылка
//                         .бир_ЗапросыКДанным
//   НомерЗапросаПакета  - Число                 - номер запроса в пакете, для которого требуется получить поля
//                                                 если не указано, то возвращаются поля последнего запроса
//                                                 используется сквозная нумерация запросов в пакете
//                                                 с учетом запросов на создание/уничтожение временных таблиц
//
// Возвращаемое значение:
//   Массив из Структура                          - параметры запроса для текущего объекта запроса
//     *Имя                      - Строка           - псевдоним поля в запросе
//     *ИспользоватьРеквизиты    - Булево           - Истина - для поля указано разыменование через ".*"
//     *ТипЗначения              - ОписаниеТипов    - тип значения поля если удалось вычислить
//
Функция ПоляЗапроса(Ид, НомерЗапросаПакета = Неопределено) Экспорт

	Запрос = Запрос(Ид, Истина);
	
	Возврат Запрос.Поля(НомерЗапросаПакета);

КонецФункции // ПоляЗапроса()

// Функция - возвращает параметры запроса для указанного объекта запроса
//
// Параметры:
//   Ид                   - СтрокаНомерЗапросаПакета    - идентификатор запроса или ссылка на элемент справочника
//                          СправочникСсылка
//                         .бир_ЗапросыКДанным
//   ЗаполнитьЗначения    - Булево                      - Истина - вычислить значения параметров
//
// Возвращаемое значение:
//   Массив из Структура                - параметры запроса для указанного объекта запроса
//     *Имя            - Строка           - имя параметра
//     *ТипЗначения    - ОписаниеТипов    - тип значения параметра
//
Функция ПараметрыЗапроса(Ид, ЗаполнитьЗначения = Ложь) Экспорт

	Запрос = Запрос(Ид, Истина);
	
	Возврат Запрос.Параметры(ЗаполнитьЗначения);

КонецФункции // ПараметрыЗапроса()

// Функция - возвращает схему запроса для указанного объекта запроса
//
// Параметры:
//   Ид    - СтрокаНомерЗапросаПакета    - идентификатор запроса или ссылка на элемент справочника
//           СправочникСсылка
//           .бир_ЗапросыКДанным
//
// Возвращаемое значение:
//   СхемаЗапроса    - схема запроса для указанного объекта запроса
//
Функция СхемаЗапроса(Ид) Экспорт

	Запрос = Запрос(Ид, Истина);
	
	Возврат Запрос.Схема();

КонецФункции // СхемаЗапроса()

// Функция - возвращает схему компоновки данных для указанного объекта запроса
//
// Параметры:
//   Ид    - СтрокаНомерЗапросаПакета    - идентификатор запроса или ссылка на элемент справочника
//           СправочникСсылка
//           .бир_ЗапросыКДанным
//
// Возвращаемое значение:
//   СхемаКомпоновкиДанных    - схема компоновки данных для указанного объекта запроса
//
Функция СКДИзЗапроса(Ид) Экспорт

	Запрос = Запрос(Ид, Истина);
	
	Возврат Запрос.СКД();

КонецФункции // СКДИзЗапроса()

// Функция - возвращает настройки компоновки данных для указанного объекта запроса
//
// Параметры:
//   Ид           - СтрокаНомерЗапросаПакета    - идентификатор запроса или ссылка на элемент справочника
//                  СправочникСсылка
//                 .бир_ЗапросыКДанным
//   Параметры    - Структура                   - значения параметров запроса
//
// Возвращаемое значение:
//   НастройкиКомпоновкиДанных    - настройки компоновки данных для указанного объекта запроса
//
Функция НастройкиКомпоновкиДанныхИзЗапроса(Знач Ид, Знач Параметры = Неопределено) Экспорт

	Запрос = Запрос(Ид, Истина);
	
	Возврат Запрос.НастройкиКомпоновкиДанных(Параметры);

КонецФункции // НастройкиКомпоновкиИзЗапроса()

// Функция - возвращает макет компоновки данных для указанного объекта запроса
//
// Параметры:
//   Ид           - СтрокаНомерЗапросаПакета    - идентификатор запроса или ссылка на элемент справочника
//                  СправочникСсылка
//                 .бир_ЗапросыКДанным
//   Параметры    - Структура                   - значения параметров запроса
//
// Возвращаемое значение:
//   МакетКомпоновкиДанных    - макет компановки данных для указанного объекта запроса
//
Функция МакетКомпоновкиДанныхИзЗапроса(Знач Ид, Знач Параметры = Неопределено) Экспорт

	Запрос = Запрос(Ид, Истина);
	
	Возврат Запрос.МакетКомпоновкиДанных(Параметры);

КонецФункции // НастройкиКомпоновкиДанныхИзЗапроса()

// Функция - выполняет указанный запрос и возвращает полученный результат
//
// Параметры:
//   Ид           - СтрокаНомерЗапросаПакета    - идентификатор запроса или ссылка на элемент справочника
//                  СправочникСсылка
//                 .бир_ЗапросыКДанным
//   Параметры    - Структура                   - значения параметров запроса
//
// Возвращаемое значение:
//   ТаблицаЗначений    - результат запроса для текущего объекта запроса
//
Функция ДанныеИзЗапроса(Знач Ид, Знач Параметры = Неопределено) Экспорт

	Запрос = Запрос(Ид, Истина);
	
	Возврат Запрос.ДанныеИзЗапроса(Параметры);

КонецФункции // ДанныеИзЗапроса()

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

// Функция - проверяет наличие недопустимых символов в идентификаторе
//
// Параметры:
//   Идентификатор          - Строка               - проверяемый идентификатор (разделеный ".")
//   НедопустимыеСимволы    - Массив из Структура  - (возвр.) массив недопустимых символов с указанием расположения
//     *Символ                - Строка               - недопустимый символ
//     *Начальный             - Булево               - недопустимый символ является начальным
//     *ЧастьИд               - Число                - номер части идентификатора
//     *Позиция               - Число                - позиция недопустимого символа в части идентификатора (ЧастьИд)
//     *ПозицияАбс            - Число                - позиция недопустимого символа от начала идентификатора
// 
// Возвращаемое значение:
//   Булево               - Истина - идентификатор не содержит недопустимых символов
//                          Ложь - в противном случае
//
Функция ИдентификаторЗапросаВалиден(Знач Идентификатор, НедопустимыеСимволы = Неопределено) Экспорт
	
	ДопустимыеСимволы = ДопустимыеСимволы();
	ДопустимыеНачальныеСимволы = ДопустимыеНачальныеСимволы();
	
	ЧастиИдентификатора = СтрРазделить(Идентификатор, ".");
	
	НедопустимыеСимволы = Новый Массив();
	
	ПозицияНачалаАбс = 0;
	
	Для й = 0 По ЧастиИдентификатора.ВГраница() Цикл
		
		ТекЧасть = ЧастиИдентификатора[й];
		
		Для к = 1 По СтрДлина(ТекЧасть) Цикл
			ТекСимвол = Сред(ТекЧасть, к, 1);
			Если ДопустимыеСимволы.Получить(ТекСимвол) = Неопределено Тогда
				НедопустимыйСимвол = Новый Структура();
				НедопустимыйСимвол.Вставить("Символ"    , ТекСимвол);
				НедопустимыйСимвол.Вставить("Начальный" , Ложь);
				НедопустимыйСимвол.Вставить("ЧастьИд"   , й + 1);
				НедопустимыйСимвол.Вставить("Позиция"   , к);
				НедопустимыйСимвол.Вставить("ПозицияАбс", ПозицияНачалаАбс + к);
				
				НедопустимыеСимволы.Добавить(НедопустимыйСимвол);
			ИначеЕсли к = 1 И ДопустимыеНачальныеСимволы.Получить(ТекСимвол) = Неопределено Тогда
				НедопустимыйСимвол = Новый Структура();
				НедопустимыйСимвол.Вставить("Символ"    , ТекСимвол);
				НедопустимыйСимвол.Вставить("Начальный" , Истина);
				НедопустимыйСимвол.Вставить("ЧастьИд"   , й + 1);
				НедопустимыйСимвол.Вставить("Позиция"   , к);
				НедопустимыйСимвол.Вставить("ПозицияАбс", ПозицияНачалаАбс + к);
				
				НедопустимыеСимволы.Добавить(НедопустимыйСимвол);
			КонецЕсли;
		КонецЦикла;
		
		ПозицияНачалаАбс = ПозицияНачалаАбс + СтрДлина(ТекЧасть) + 1;
		
	КонецЦикла;
	
	Возврат (НедопустимыеСимволы.Количество() = 0);
	
КонецФункции // ИдентификаторЗапросаВалиден()

// Функция - проверяет занятость идентификатора запроса
//
// Параметры:
//   Идентификатор  - Строка                   - проверяемый идентификатор (разделеный ".")
//   ЗапросСсылка   - СправочникСсылка         - элемент справочника для которого проверяется идентификатор
//                    .бир_ЗапросыКДанным
//   ВладелецИд     - СправочникСсылка         - (возвр.) элемент - владелец идентификатора если идентификатор занят
//                    .бир_ЗапросыКДанным
// 
// Возвращаемое значение:
//   Булево         - Истина - идентификатор свободен
//                     Ложь - в противном случае
//
Функция ИдентификаторЗапросаСвободен(Знач Идентификатор, ЗапросСсылка = Неопределено, ВладелецИд = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЗапросыКДанным.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.бир_ЗапросыКДанным КАК ЗапросыКДанным
	                      |ГДЕ
	                      |	НЕ ЗапросыКДанным.ЭтоГруппа
	                      |	И ЗапросыКДанным.Ид = &Ид
	                      |	И НЕ ЗапросыКДанным.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ид"    , Идентификатор);
	Запрос.УстановитьПараметр("Ссылка", ЗапросСсылка);
	
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВладелецИд = Выборка.Ссылка;
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ИдентификаторЗапросаСвободен()

// Функция - выполняет проверки идентификатора запроса на валидность и занятость
// и возвращает результат проверок с описанием возникших ошибок
//
// Параметры:
//   Идентификатор  - Строка                - проверяемый идентификатор (разделеный ".")
//   ЗапросСсылка   - СправочникСсылка      - элемент справочника для которого проверяется идентификатор
//                    .бир_ЗапросыКДанным
// 
// Возвращаемое значение:
//   Структура                                        - результат проверки идентификатора
//     *Свободен               - Булево                 - Истина - идентификатор уникален
//     *Валиден                - Булево                 - Истина - идентификатор не содержит недопустимых символов
//     *Пустой                 - Булево                 - Истина - идентификатор пустой
//     *НедопустимыеСимволы    - Массив из Структура    - массив недопустимых символов с указанием расположения
//     *Ошибки                 - Массив из Строка       - массив описаний найденных ошибок
//
Функция ПроверитьИдентификаторЗапроса(Знач Идентификатор, ЗапросСсылка = Неопределено) Экспорт
	
	Результат = Новый Структура();
	Результат.Вставить("Свободен"           , Истина);
	Результат.Вставить("Валиден"            , Истина);
	Результат.Вставить("Пустой"             , НЕ ЗначениеЗаполнено(Идентификатор));
	Результат.Вставить("Владелец"           , Неопределено);
	Результат.Вставить("НедопустимыеСимволы", Новый Массив());
	Результат.Вставить("Ошибки"             , Новый Массив());
	
	Если Результат.Пустой Тогда
		Результат.Валиден = Ложь;
		Результат.Ошибки.Добавить("Идентификатор не заполнен");
		Возврат Результат;
	КонецЕсли;
	
	Результат.Свободен = ИдентификаторЗапросаСвободен(Идентификатор, ЗапросСсылка, Результат.Владелец);
	Результат.Валиден = ИдентификаторЗапросаВалиден(Идентификатор, Результат.НедопустимыеСимволы);
	
	Если НЕ Результат.Валиден Тогда
		Для Каждого ТекСимвол Из Результат.НедопустимыеСимволы Цикл

			ТекстДо = Лев(Идентификатор, ТекСимвол.ПозицияАбс - 1);
			ТекстПосле = Сред(Идентификатор, ТекСимвол.ПозицияАбс + 1);

			ПредставлениеИд = СтрШаблон("%1~>%2<~%3", ТекстДо, ТекСимвол.Символ, ТекстПосле);
			ТекстСимвол = ?(ТекСимвол.Начальный, "начальный символ", "символ");
			ТекстПозиция = ?(ТекСимвол.Начальный, "", СтрШаблон(" в позиции %1", ТекСимвол.ПозицияАбс));
			ТекстОшибки = "Недопустимый %1 ""%2""%3 в идентификаторе ""%4""!";

			ТекстОшибки = СтрШаблон(ТекстОшибки, ТекстСимвол, ТекСимвол.Символ,	ТекстПозиция, ПредставлениеИд);
			Результат.Ошибки.Добавить(ТекстОшибки);

		КонецЦикла;
	КонецЕсли;

	Если НЕ Результат.Свободен Тогда
		ТекстОшибки = Новый Массив();
		ТекстОшибки.Добавить(СтрШаблон("Идентификатор ""%1"" используется для запроса ", Идентификатор));
		ТекстОшибки.Добавить(Новый ФорматированнаяСтрока(СокрЛП(Результат.Владелец),
		                                                 ,
														 ЦветаСтиля.ГиперссылкаЦвет,
														 ,
														 ПолучитьНавигационнуюСсылку(Результат.Владелец)));
		Результат.Ошибки.Добавить(Новый ФорматированнаяСтрока(ТекстОшибки));
	КонецЕсли;

	Возврат Результат;

КонецФункции // ПроверитьИдентификаторЗапроса()

// Функция - возвращает новый идентификатор запроса
//
// Параметры:
//   Наименование    - Строка                 - наименование запроса
//   ЗапросСсылка    - СправочникСсылка       - элемент справочника для которого проверяется идентификатор
//                     .бир_ЗапросыКДанным
//
// Возвращаемое значение:
//   Строка    - новый идентификатор запроса
//
Функция НовыйИдентификаторЗапроса(Знач Наименование, ЗапросСсылка = Неопределено) Экспорт

	Префикс = ИдентификаторИзСтроки(Наименование);

	Если ИдентификаторЗапросаСвободен(Префикс, ЗапросСсылка) Тогда
		Возврат Префикс;
	КонецЕсли;

	Запрос = Новый Запрос();

	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗапросыКДанным.Ид КАК Ид
	               |ИЗ
	               |	Справочник.бир_ЗапросыКДанным КАК ЗапросыКДанным
	               |ГДЕ
	               |	НЕ ЗапросыКДанным.ЭтоГруппа
	               |	И НЕ ЗапросыКДанным.Ссылка = &Запрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Ид";

	Запрос.УстановитьПараметр("Запрос", ЗапросСсылка);

	Результат = Запрос.Выполнить();

	Выборка = Результат.Выбрать();

	МаксНомерЗапроса = -1;
	ЗанятыеНомера = Новый Соответствие();
	Пока Выборка.Следующий() Цикл
		Если НЕ Лев(СокрЛП(Выборка.Ид), СтрДлина(Префикс)) = Префикс Тогда
			Продолжить;
		КонецЕсли;

		Суффикс = Сред(СокрЛП(Выборка.Ид), СтрДлина(Префикс) + 1);
		Суффикс = ?(Суффикс = "", 0, Суффикс);
		
		НомерЗапроса = -1;
		Если ОбщегоНазначенияКлиентСервер.ЭтоЧисло(Суффикс) Тогда
			НомерЗапроса = Число(Суффикс);
		КонецЕсли;
		МаксНомерЗапроса = Макс(МаксНомерЗапроса, НомерЗапроса);
		ЗанятыеНомера.Вставить(НомерЗапроса, Истина);
	КонецЦикла;

	НомерЗапроса = МаксНомерЗапроса + 1;
	Для й = 1 По МаксНомерЗапроса Цикл
		Если ЗанятыеНомера.Получить(й) = Неопределено Тогда
			НомерЗапроса = й;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	НомерЗапроса = ?(НомерЗапроса = 0, "", Формат(НомерЗапроса, "ЧДЦ=0; ЧН=; ЧГ="));

	Возврат СтрШаблон("%1%2", Префикс, НомерЗапроса);

КонецФункции // НовыйИдентификаторЗапроса()

// Функция - заменяет в переданной строке недопустимые символы на "_",
// убирает пробелы и переводит символы, следовавшие за пробелом в верхний регистр
//
// Параметры:
//   ИсходнаяСтрока    - Строка    - строка для обработки
//
// Возвращаемое значение:
//   Строка    - преобразованная строка
//
Функция ИдентификаторИзСтроки(Знач ИсходнаяСтрока) Экспорт
  
	ДлинаСтроки = СтрДлина(ИсходнаяСтрока);
	
	ДопустимыеСимволы = ДопустимыеСимволы();
	ДопустимыеНачальныеСимволы = ДопустимыеНачальныеСимволы();
	
	СимволПробела = " ";
	СимволПодчеркивания = "_";
	
	Результат = Новый Массив();
	
	Для й = 1 По ДлинаСтроки Цикл
		ТекСимвол = Сред(ИсходнаяСтрока, й, 1);
		НедопустимыйСимвол = (Результат.Количество() = 0 И ДопустимыеНачальныеСимволы.Получить(ТекСимвол) = Неопределено)
		                  ИЛИ (Результат.Количество() > 0 И ДопустимыеСимволы.Получить(ТекСимвол) = Неопределено);
		ВерхнийРегистр = (Результат.Количество() = 0 ИЛИ Результат[Результат.ВГраница()] = "");
		Если ТекСимвол = СимволПробела Тогда
			Результат.Добавить("");
		ИначеЕсли НедопустимыйСимвол Тогда
			Результат.Добавить(СимволПодчеркивания);
		ИначеЕсли ВерхнийРегистр Тогда
			Результат.Добавить(ВРег(ТекСимвол));
		Иначе
			Результат.Добавить(ТекСимвол);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(Результат, "");
	
КонецФункции // ИдентификаторИзСтроки()

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

// Функция - возвращает список допустимых символов для идентификаторов
// 
// Возвращаемое значение:
//   Соответствие - список допустимых символов
//
Функция ДопустимыеСимволы()
  
	ДопустимыеСимволы = ДопустимыеНачальныеСимволы();
	
	КодСимвола1 = 48;
	КодСимвола9 = 57;
	Для й = КодСимвола1 По КодСимвола9 Цикл
		ДопустимыеСимволы.Вставить(Символ(й), Истина);
	КонецЦикла;
	
	Возврат ДопустимыеСимволы;
  
КонецФункции // ДопустимыеСимволы()

// Функция - возвращает список допустимых начальных символов для идентификаторов
// 
// Возвращаемое значение:
//   Соответствие - список допустимых символов
//
Функция ДопустимыеНачальныеСимволы()
  
	ДопустимыеСимволы = Новый Соответствие();
	
	ДопустимыеСимволы.Вставить("_", Истина);
	
	КодСимвола_A = 97;
	КодСимвола_z = 122;
	Для й = КодСимвола_A По КодСимвола_z Цикл
		ДопустимыеСимволы.Вставить(Символ(й), Истина);
		ДопустимыеСимволы.Вставить(ВРег(Символ(й)), Истина);
	КонецЦикла;
	
	КодСимвола_А = 1072;
	КодСимвола_я = 1103;
	Для й = КодСимвола_А По КодСимвола_я Цикл
		ДопустимыеСимволы.Вставить(Символ(й), Истина);
		ДопустимыеСимволы.Вставить(ВРег(Символ(й)), Истина);
	КонецЦикла;
	
	ДопустимыеСимволы.Вставить("ё", Истина);
	ДопустимыеСимволы.Вставить("Ё", Истина);
	
	Возврат ДопустимыеСимволы;
  
КонецФункции // ДопустимыеНачальныеСимволы()

#КонецОбласти // СлужебныеПроцедурыИФункции
